cf_billing/InformationRegisters/бестНастройкаОтправкиПочтыИзБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаОтправкиПочтыИзБП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПроверкаКомплектаДокументов</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестПодготовкаПроектаДоговора</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеДокументаРуководителю</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестНаправлениеПротоколаРазногласийЮристам</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.бестЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаОтправкиПочтыИзБП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерефейс

Функция ПолучитьУчетнуюЗапись(ТочкаМаршрутаБизнесПроцесса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестНастройкаОтправкиПочтыИзБП.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.бестНастройкаОтправкиПочтыИзБП КАК бестНастройкаОтправкиПочтыИзБП
	|ГДЕ
	|	бестНастройкаОтправкиПочтыИзБП.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.УчетнаяЗапись;
	Иначе 
		Возврат РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	КонецЕсли;;
КонецФункции

#КонецОбласти

#КонецЕсли
